geastack/targets/targets/esp32-p4-waveshare-touch-lcd-3.5/sdkconfig.defaults
# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# Flash: 16 MB (Waveshare ESP32-P4-WIFI6-Touch-LCD-3.5)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# The first Waveshare ESP32-P4-WIFI6-Touch-LCD-7 unit reports ESP32-P4 rev
# v1.3. ESP-IDF defaults to rev v3.1+, whose bootloader rejects this board.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Keep the console on UART0 (USB-JTAG stays secondary); the ESP32-P4 USB Serial/JTAG
# bootloader console init path hangs on the Waveshare rev v1.3 board during early
# bring-up, so UART must remain primary. Use CUSTOM (default pins via GPIO=-1) so the
# baud is settable: stdout is mirrored to UART0 + USB-JTAG and the write blocks on the
# slower UART, so the camera-capture base64 stream (multi-MB) is gated by this baud.
# 921600 makes it ~8x faster; the host reads the baud-agnostic USB-JTAG side.
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=-1
CONFIG_ESP_CONSOLE_UART_RX_GPIO=-1
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

# Custom partition table with two OTA slots and installable app storage.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Runtime timing and task budgets. The P4 creates its two IPC tasks before the
# IDF main task; keeping IPC at the older S3 16 KiB value fragments internal
# SRAM enough that the 32 KiB main stack cannot be allocated at startup.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_IPC_TASK_STACK_SIZE=4096

# External PSRAM is required for the 720x1280 RGB565 framebuffer and staging
# buffers. Keep internal memory globally allocatable; code asks for DMA/internal
# caps explicitly when needed.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=0

# Camera: Waveshare's ESP32-P4-WIFI6-Touch-LCD-X examples use the onboard
# OV5647 over MIPI-CSI through the esp_video ISP pipeline.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CAMERA_OV5647=y
# Preview/streaming mode: the 1280x960 2x2-binning mode (index 4) is the mode the
# stock Waveshare/ESP-Brookesia camera app uses on this exact rev-v1.3 board, and
# it streams RGB565 cleanly through the ISP. The 1920x1080 RAW10 mode (index 3)
# trips the IDF 6.0 CSI bridge color-conversion gate (HW-gated to chip rev >=v3.0)
# on this v1.3 silicon, so STREAMON fails. Use the binning mode for the live view.
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280x960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DAFAULT=4
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
# Hardware H.264 encoder exposed as a V4L2 M2M device (/dev/video11) for the
# full-resolution 1080p video recording path (Camera.recordH264Clip).
CONFIG_ESP_VIDEO_ENABLE_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
# esp_video registers several /dev/video* VFS entries; with the console + the
# /sdcard FAT mount the default cap of 8 is exhausted (mount fails with NO_MEM).
CONFIG_VFS_MAX_COUNT=16
# microSD cards use 512-byte logical sectors; IDF's FATFS defaults to 4096 (for the
# on-flash wear-levelled FAT), which fails to mount an SD card (FR_NO_FILESYSTEM).
CONFIG_FATFS_SECTOR_512=y
# exFAT support is enabled in ffconf.h (FF_FS_EXFAT=1) so the board can read exFAT
# microSD cards; the exFAT code path references FF_USE_LABEL as a C value, so the
# volume-label option must be defined (it's "not set" => undefined => won't compile).
CONFIG_FATFS_USE_LABEL=y
# CONFIG_ESP_H264_DECODER_IRAM is not set

# WebRTC: mbedTLS DTLS + DTLS-SRTP for esp_peer.
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_DTLS_CONNECTION_ID=y
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_X509_CRT_WRITE_C=y
CONFIG_MBEDTLS_X509_CSR_WRITE_C=y

# Release optimization level for the large display workload.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2

# Development logging / diagnostics defaults.
# CONFIG_GEA_EMBEDDED_PRODUCTION_LOCKDOWN is not set
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_LOG_MAXIMUM_LEVEL=3
# CONFIG_BOOTLOADER_LOG_LEVEL_NONE is not set
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL=3

# Keep standalone heap tracing available for framebuffer/app-init diagnosis.
# Heap tracing costs about a kilobyte of IRAM and puts a hook on the allocator's
# hot path. The framework's only users, the display and AXP2101 init traces, are
# already gated on GEA_EMBEDDED_HEAP_DIAGNOSTICS_LOG, which defaults to 0, so
# nothing traced by default and every app paid for it. Turn this and that macro
# on together when you actually want a trace.
CONFIG_HEAP_TRACING_OFF=y
# CONFIG_HEAP_TRACING_STANDALONE is not set
# CONFIG_HEAP_TRACING_TOHOST is not set
# CONFIG_HEAP_TRACING is not set
# CONFIG_HEAP_TRACE_HASH_MAP is not set
